GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k80.inc
// Register: RXB1EIDH
#define RXB1EIDH RXB1EIDH
RXB1EIDH                                 equ 0F33h
// bitfield definitions
RXB1EIDH_EID_POSN                        equ 0000h
RXB1EIDH_EID_POSITION                    equ 0000h
RXB1EIDH_EID_SIZE                        equ 0008h
RXB1EIDH_EID_LENGTH                      equ 0008h
RXB1EIDH_EID_MASK                        equ 00FFh
RXB1EIDH_EID8_POSN                       equ 0000h
RXB1EIDH_EID8_POSITION                   equ 0000h
RXB1EIDH_EID8_SIZE                       equ 0001h
RXB1EIDH_EID8_LENGTH                     equ 0001h
RXB1EIDH_EID8_MASK                       equ 0001h
RXB1EIDH_EID9_POSN                       equ 0001h
RXB1EIDH_EID9_POSITION                   equ 0001h
RXB1EIDH_EID9_SIZE                       equ 0001h
RXB1EIDH_EID9_LENGTH                     equ 0001h
RXB1EIDH_EID9_MASK                       equ 0002h
RXB1EIDH_EID10_POSN                      equ 0002h
RXB1EIDH_EID10_POSITION                  equ 0002h
RXB1EIDH_EID10_SIZE                      equ 0001h
RXB1EIDH_EID10_LENGTH                    equ 0001h
RXB1EIDH_EID10_MASK                      equ 0004h
RXB1EIDH_EID11_POSN                      equ 0003h
RXB1EIDH_EID11_POSITION                  equ 0003h
RXB1EIDH_EID11_SIZE                      equ 0001h
RXB1EIDH_EID11_LENGTH                    equ 0001h
RXB1EIDH_EID11_MASK                      equ 0008h
RXB1EIDH_EID12_POSN                      equ 0004h
RXB1EIDH_EID12_POSITION                  equ 0004h
RXB1EIDH_EID12_SIZE                      equ 0001h
RXB1EIDH_EID12_LENGTH                    equ 0001h
RXB1EIDH_EID12_MASK                      equ 0010h
RXB1EIDH_EID13_POSN                      equ 0005h
RXB1EIDH_EID13_POSITION                  equ 0005h
RXB1EIDH_EID13_SIZE                      equ 0001h
RXB1EIDH_EID13_LENGTH                    equ 0001h
RXB1EIDH_EID13_MASK                      equ 0020h
RXB1EIDH_EID14_POSN                      equ 0006h
RXB1EIDH_EID14_POSITION                  equ 0006h
RXB1EIDH_EID14_SIZE                      equ 0001h
RXB1EIDH_EID14_LENGTH                    equ 0001h
RXB1EIDH_EID14_MASK                      equ 0040h
RXB1EIDH_EID15_POSN                      equ 0007h
RXB1EIDH_EID15_POSITION                  equ 0007h
RXB1EIDH_EID15_SIZE                      equ 0001h
RXB1EIDH_EID15_LENGTH                    equ 0001h
RXB1EIDH_EID15_MASK                      equ 0080h
RXB1EIDH_RXB1EID8_POSN                   equ 0000h
RXB1EIDH_RXB1EID8_POSITION               equ 0000h
RXB1EIDH_RXB1EID8_SIZE                   equ 0001h
RXB1EIDH_RXB1EID8_LENGTH                 equ 0001h
RXB1EIDH_RXB1EID8_MASK                   equ 0001h
RXB1EIDH_RXB1EID9_POSN                   equ 0001h
RXB1EIDH_RXB1EID9_POSITION               equ 0001h
RXB1EIDH_RXB1EID9_SIZE                   equ 0001h
RXB1EIDH_RXB1EID9_LENGTH                 equ 0001h
RXB1EIDH_RXB1EID9_MASK                   equ 0002h
RXB1EIDH_RXB1EID10_POSN                  equ 0002h
RXB1EIDH_RXB1EID10_POSITION              equ 0002h
RXB1EIDH_RXB1EID10_SIZE                  equ 0001h
RXB1EIDH_RXB1EID10_LENGTH                equ 0001h
RXB1EIDH_RXB1EID10_MASK                  equ 0004h
RXB1EIDH_RXB1EID11_POSN                  equ 0003h
RXB1EIDH_RXB1EID11_POSITION              equ 0003h
RXB1EIDH_RXB1EID11_SIZE                  equ 0001h
RXB1EIDH_RXB1EID11_LENGTH                equ 0001h
RXB1EIDH_RXB1EID11_MASK                  equ 0008h
RXB1EIDH_RXB1EID12_POSN                  equ 0004h
RXB1EIDH_RXB1EID12_POSITION              equ 0004h
RXB1EIDH_RXB1EID12_SIZE                  equ 0001h
RXB1EIDH_RXB1EID12_LENGTH                equ 0001h
RXB1EIDH_RXB1EID12_MASK                  equ 0010h
RXB1EIDH_RXB1EID13_POSN                  equ 0005h
RXB1EIDH_RXB1EID13_POSITION              equ 0005h
RXB1EIDH_RXB1EID13_SIZE                  equ 0001h
RXB1EIDH_RXB1EID13_LENGTH                equ 0001h
RXB1EIDH_RXB1EID13_MASK                  equ 0020h
RXB1EIDH_RXB1EID14_POSN                  equ 0006h
RXB1EIDH_RXB1EID14_POSITION              equ 0006h
RXB1EIDH_RXB1EID14_SIZE                  equ 0001h
RXB1EIDH_RXB1EID14_LENGTH                equ 0001h
RXB1EIDH_RXB1EID14_MASK                  equ 0040h
RXB1EIDH_RXB1EID15_POSN                  equ 0007h
RXB1EIDH_RXB1EID15_POSITION              equ 0007h
RXB1EIDH_RXB1EID15_SIZE                  equ 0001h
RXB1EIDH_RXB1EID15_LENGTH                equ 0001h
RXB1EIDH_RXB1EID15_MASK                  equ 0080h

// Register: RXB1EIDL
#define RXB1EIDL RXB1EIDL
RXB1EIDL                                 equ 0F34h
// bitfield definitions
RXB1EIDL_EID_POSN                        equ 0000h
RXB1EIDL_EID_POSITION                    equ 0000h
RXB1EIDL_EID_SIZE                        equ 0008h
RXB1EIDL_EID_LENGTH                      equ 0008h
RXB1EIDL_EID_MASK                        equ 00FFh
RXB1EIDL_EID0_POSN                       equ 0000h
RXB1EIDL_EID0_POSITION                   equ 0000h
RXB1EIDL_EID0_SIZE                       equ 0001h
RXB1EIDL_EID0_LENGTH                     equ 0001h
RXB1EIDL_EID0_MASK                       equ 0001h
RXB1EIDL_EID1_POSN                       equ 0001h
RXB1EIDL_EID1_POSITION                   equ 0001h
RXB1EIDL_EID1_SIZE                       equ 0001h
RXB1EIDL_EID1_LENGTH                     equ 0001h
RXB1EIDL_EID1_MASK                       equ 0002h
RXB1EIDL_EID2_POSN                       equ 0002h
RXB1EIDL_EID2_POSITION                   equ 0002h
RXB1EIDL_EID2_SIZE                       equ 0001h
RXB1EIDL_EID2_LENGTH                     equ 0001h
RXB1EIDL_EID2_MASK                       equ 0004h
RXB1EIDL_EID3_POSN                       equ 0003h
RXB1EIDL_EID3_POSITION                   equ 0003h
RXB1EIDL_EID3_SIZE                       equ 0001h
RXB1EIDL_EID3_LENGTH                     equ 0001h
RXB1EIDL_EID3_MASK                       equ 0008h
RXB1EIDL_EID4_POSN                       equ 0004h
RXB1EIDL_EID4_POSITION                   equ 0004h
RXB1EIDL_EID4_SIZE                       equ 0001h
RXB1EIDL_EID4_LENGTH                     equ 0001h
RXB1EIDL_EID4_MASK                       equ 0010h
RXB1EIDL_EID5_POSN                       equ 0005h
RXB1EIDL_EID5_POSITION                   equ 0005h
RXB1EIDL_EID5_SIZE                       equ 0001h
RXB1EIDL_EID5_LENGTH                     equ 0001h
RXB1EIDL_EID5_MASK                       equ 0020h
RXB1EIDL_EID6_POSN                       equ 0006h
RXB1EIDL_EID6_POSITION                   equ 0006h
RXB1EIDL_EID6_SIZE                       equ 0001h
RXB1EIDL_EID6_LENGTH                     equ 0001h
RXB1EIDL_EID6_MASK                       equ 0040h
RXB1EIDL_EID7_POSN                       equ 0007h
RXB1EIDL_EID7_POSITION                   equ 0007h
RXB1EIDL_EID7_SIZE                       equ 0001h
RXB1EIDL_EID7_LENGTH                     equ 0001h
RXB1EIDL_EID7_MASK                       equ 0080h
RXB1EIDL_RXB1EID0_POSN                   equ 0000h
RXB1EIDL_RXB1EID0_POSITION               equ 0000h
RXB1EIDL_RXB1EID0_SIZE                   equ 0001h
RXB1EIDL_RXB1EID0_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID0_MASK                   equ 0001h
RXB1EIDL_RXB1EID1_POSN                   equ 0001h
RXB1EIDL_RXB1EID1_POSITION               equ 0001h
RXB1EIDL_RXB1EID1_SIZE                   equ 0001h
RXB1EIDL_RXB1EID1_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID1_MASK                   equ 0002h
RXB1EIDL_RXB1EID2_POSN                   equ 0002h
RXB1EIDL_RXB1EID2_POSITION               equ 0002h
RXB1EIDL_RXB1EID2_SIZE                   equ 0001h
RXB1EIDL_RXB1EID2_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID2_MASK                   equ 0004h
RXB1EIDL_RXB1EID3_POSN                   equ 0003h
RXB1EIDL_RXB1EID3_POSITION               equ 0003h
RXB1EIDL_RXB1EID3_SIZE                   equ 0001h
RXB1EIDL_RXB1EID3_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID3_MASK                   equ 0008h
RXB1EIDL_RXB1EID4_POSN                   equ 0004h
RXB1EIDL_RXB1EID4_POSITION               equ 0004h
RXB1EIDL_RXB1EID4_SIZE                   equ 0001h
RXB1EIDL_RXB1EID4_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID4_MASK                   equ 0010h
RXB1EIDL_RXB1EID5_POSN                   equ 0005h
RXB1EIDL_RXB1EID5_POSITION               equ 0005h
RXB1EIDL_RXB1EID5_SIZE                   equ 0001h
RXB1EIDL_RXB1EID5_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID5_MASK                   equ 0020h
RXB1EIDL_RXB1EID6_POSN                   equ 0006h
RXB1EIDL_RXB1EID6_POSITION               equ 0006h
RXB1EIDL_RXB1EID6_SIZE                   equ 0001h
RXB1EIDL_RXB1EID6_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID6_MASK                   equ 0040h
RXB1EIDL_RXB1EID7_POSN                   equ 0007h
RXB1EIDL_RXB1EID7_POSITION               equ 0007h
RXB1EIDL_RXB1EID7_SIZE                   equ 0001h
RXB1EIDL_RXB1EID7_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID7_MASK                   equ 0080h

