GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k80.inc
// Register: RXB0SIDL
#define RXB0SIDL RXB0SIDL
RXB0SIDL                                 equ 0F62h
// bitfield definitions
RXB0SIDL_EID_POSN                        equ 0000h
RXB0SIDL_EID_POSITION                    equ 0000h
RXB0SIDL_EID_SIZE                        equ 0002h
RXB0SIDL_EID_LENGTH                      equ 0002h
RXB0SIDL_EID_MASK                        equ 0003h
RXB0SIDL_EXID_POSN                       equ 0003h
RXB0SIDL_EXID_POSITION                   equ 0003h
RXB0SIDL_EXID_SIZE                       equ 0001h
RXB0SIDL_EXID_LENGTH                     equ 0001h
RXB0SIDL_EXID_MASK                       equ 0008h
RXB0SIDL_SRR_POSN                        equ 0004h
RXB0SIDL_SRR_POSITION                    equ 0004h
RXB0SIDL_SRR_SIZE                        equ 0001h
RXB0SIDL_SRR_LENGTH                      equ 0001h
RXB0SIDL_SRR_MASK                        equ 0010h
RXB0SIDL_SID_POSN                        equ 0005h
RXB0SIDL_SID_POSITION                    equ 0005h
RXB0SIDL_SID_SIZE                        equ 0003h
RXB0SIDL_SID_LENGTH                      equ 0003h
RXB0SIDL_SID_MASK                        equ 00E0h
RXB0SIDL_EID16_POSN                      equ 0000h
RXB0SIDL_EID16_POSITION                  equ 0000h
RXB0SIDL_EID16_SIZE                      equ 0001h
RXB0SIDL_EID16_LENGTH                    equ 0001h
RXB0SIDL_EID16_MASK                      equ 0001h
RXB0SIDL_EID17_POSN                      equ 0001h
RXB0SIDL_EID17_POSITION                  equ 0001h
RXB0SIDL_EID17_SIZE                      equ 0001h
RXB0SIDL_EID17_LENGTH                    equ 0001h
RXB0SIDL_EID17_MASK                      equ 0002h
RXB0SIDL_SID0_POSN                       equ 0005h
RXB0SIDL_SID0_POSITION                   equ 0005h
RXB0SIDL_SID0_SIZE                       equ 0001h
RXB0SIDL_SID0_LENGTH                     equ 0001h
RXB0SIDL_SID0_MASK                       equ 0020h
RXB0SIDL_SID1_POSN                       equ 0006h
RXB0SIDL_SID1_POSITION                   equ 0006h
RXB0SIDL_SID1_SIZE                       equ 0001h
RXB0SIDL_SID1_LENGTH                     equ 0001h
RXB0SIDL_SID1_MASK                       equ 0040h
RXB0SIDL_SID2_POSN                       equ 0007h
RXB0SIDL_SID2_POSITION                   equ 0007h
RXB0SIDL_SID2_SIZE                       equ 0001h
RXB0SIDL_SID2_LENGTH                     equ 0001h
RXB0SIDL_SID2_MASK                       equ 0080h
RXB0SIDL_RXB0EID16_POSN                  equ 0000h
RXB0SIDL_RXB0EID16_POSITION              equ 0000h
RXB0SIDL_RXB0EID16_SIZE                  equ 0001h
RXB0SIDL_RXB0EID16_LENGTH                equ 0001h
RXB0SIDL_RXB0EID16_MASK                  equ 0001h
RXB0SIDL_RXB0EID17_POSN                  equ 0001h
RXB0SIDL_RXB0EID17_POSITION              equ 0001h
RXB0SIDL_RXB0EID17_SIZE                  equ 0001h
RXB0SIDL_RXB0EID17_LENGTH                equ 0001h
RXB0SIDL_RXB0EID17_MASK                  equ 0002h
RXB0SIDL_RXB0EXID_POSN                   equ 0003h
RXB0SIDL_RXB0EXID_POSITION               equ 0003h
RXB0SIDL_RXB0EXID_SIZE                   equ 0001h
RXB0SIDL_RXB0EXID_LENGTH                 equ 0001h
RXB0SIDL_RXB0EXID_MASK                   equ 0008h
RXB0SIDL_RXB0SRR_POSN                    equ 0004h
RXB0SIDL_RXB0SRR_POSITION                equ 0004h
RXB0SIDL_RXB0SRR_SIZE                    equ 0001h
RXB0SIDL_RXB0SRR_LENGTH                  equ 0001h
RXB0SIDL_RXB0SRR_MASK                    equ 0010h
RXB0SIDL_RXB0SID0_POSN                   equ 0005h
RXB0SIDL_RXB0SID0_POSITION               equ 0005h
RXB0SIDL_RXB0SID0_SIZE                   equ 0001h
RXB0SIDL_RXB0SID0_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID0_MASK                   equ 0020h
RXB0SIDL_RXB0SID1_POSN                   equ 0006h
RXB0SIDL_RXB0SID1_POSITION               equ 0006h
RXB0SIDL_RXB0SID1_SIZE                   equ 0001h
RXB0SIDL_RXB0SID1_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID1_MASK                   equ 0040h
RXB0SIDL_RXB0SID2_POSN                   equ 0007h
RXB0SIDL_RXB0SID2_POSITION               equ 0007h
RXB0SIDL_RXB0SID2_SIZE                   equ 0001h
RXB0SIDL_RXB0SID2_LENGTH                 equ 0001h
RXB0SIDL_RXB0SID2_MASK                   equ 0080h

// Register: RXB0EIDH
#define RXB0EIDH RXB0EIDH
RXB0EIDH                                 equ 0F63h
// bitfield definitions
RXB0EIDH_EID_POSN                        equ 0000h
RXB0EIDH_EID_POSITION                    equ 0000h
RXB0EIDH_EID_SIZE                        equ 0008h
RXB0EIDH_EID_LENGTH                      equ 0008h
RXB0EIDH_EID_MASK                        equ 00FFh
RXB0EIDH_EID8_POSN                       equ 0000h
RXB0EIDH_EID8_POSITION                   equ 0000h
RXB0EIDH_EID8_SIZE                       equ 0001h
RXB0EIDH_EID8_LENGTH                     equ 0001h
RXB0EIDH_EID8_MASK                       equ 0001h
RXB0EIDH_EID9_POSN                       equ 0001h
RXB0EIDH_EID9_POSITION                   equ 0001h
RXB0EIDH_EID9_SIZE                       equ 0001h
RXB0EIDH_EID9_LENGTH                     equ 0001h
RXB0EIDH_EID9_MASK                       equ 0002h
RXB0EIDH_EID10_POSN                      equ 0002h
RXB0EIDH_EID10_POSITION                  equ 0002h
RXB0EIDH_EID10_SIZE                      equ 0001h
RXB0EIDH_EID10_LENGTH                    equ 0001h
RXB0EIDH_EID10_MASK                      equ 0004h
RXB0EIDH_EID11_POSN                      equ 0003h
RXB0EIDH_EID11_POSITION                  equ 0003h
RXB0EIDH_EID11_SIZE                      equ 0001h
RXB0EIDH_EID11_LENGTH                    equ 0001h
RXB0EIDH_EID11_MASK                      equ 0008h
RXB0EIDH_EID12_POSN                      equ 0004h
RXB0EIDH_EID12_POSITION                  equ 0004h
RXB0EIDH_EID12_SIZE                      equ 0001h
RXB0EIDH_EID12_LENGTH                    equ 0001h
RXB0EIDH_EID12_MASK                      equ 0010h
RXB0EIDH_EID13_POSN                      equ 0005h
RXB0EIDH_EID13_POSITION                  equ 0005h
RXB0EIDH_EID13_SIZE                      equ 0001h
RXB0EIDH_EID13_LENGTH                    equ 0001h
RXB0EIDH_EID13_MASK                      equ 0020h
RXB0EIDH_EID14_POSN                      equ 0006h
RXB0EIDH_EID14_POSITION                  equ 0006h
RXB0EIDH_EID14_SIZE                      equ 0001h
RXB0EIDH_EID14_LENGTH                    equ 0001h
RXB0EIDH_EID14_MASK                      equ 0040h
RXB0EIDH_EID15_POSN                      equ 0007h
RXB0EIDH_EID15_POSITION                  equ 0007h
RXB0EIDH_EID15_SIZE                      equ 0001h
RXB0EIDH_EID15_LENGTH                    equ 0001h
RXB0EIDH_EID15_MASK                      equ 0080h
RXB0EIDH_RXB0EID8_POSN                   equ 0000h
RXB0EIDH_RXB0EID8_POSITION               equ 0000h
RXB0EIDH_RXB0EID8_SIZE                   equ 0001h
RXB0EIDH_RXB0EID8_LENGTH                 equ 0001h
RXB0EIDH_RXB0EID8_MASK                   equ 0001h
RXB0EIDH_RXB0EID9_POSN                   equ 0001h
RXB0EIDH_RXB0EID9_POSITION               equ 0001h
RXB0EIDH_RXB0EID9_SIZE                   equ 0001h
RXB0EIDH_RXB0EID9_LENGTH                 equ 0001h
RXB0EIDH_RXB0EID9_MASK                   equ 0002h
RXB0EIDH_RXB0EID10_POSN                  equ 0002h
RXB0EIDH_RXB0EID10_POSITION              equ 0002h
RXB0EIDH_RXB0EID10_SIZE                  equ 0001h
RXB0EIDH_RXB0EID10_LENGTH                equ 0001h
RXB0EIDH_RXB0EID10_MASK                  equ 0004h
RXB0EIDH_RXB0EID11_POSN                  equ 0003h
RXB0EIDH_RXB0EID11_POSITION              equ 0003h
RXB0EIDH_RXB0EID11_SIZE                  equ 0001h
RXB0EIDH_RXB0EID11_LENGTH                equ 0001h
RXB0EIDH_RXB0EID11_MASK                  equ 0008h
RXB0EIDH_RXB0EID12_POSN                  equ 0004h
RXB0EIDH_RXB0EID12_POSITION              equ 0004h
RXB0EIDH_RXB0EID12_SIZE                  equ 0001h
RXB0EIDH_RXB0EID12_LENGTH                equ 0001h
RXB0EIDH_RXB0EID12_MASK                  equ 0010h
RXB0EIDH_RXB0EID13_POSN                  equ 0005h
RXB0EIDH_RXB0EID13_POSITION              equ 0005h
RXB0EIDH_RXB0EID13_SIZE                  equ 0001h
RXB0EIDH_RXB0EID13_LENGTH                equ 0001h
RXB0EIDH_RXB0EID13_MASK                  equ 0020h
RXB0EIDH_RXB0EID14_POSN                  equ 0006h
RXB0EIDH_RXB0EID14_POSITION              equ 0006h
RXB0EIDH_RXB0EID14_SIZE                  equ 0001h
RXB0EIDH_RXB0EID14_LENGTH                equ 0001h
RXB0EIDH_RXB0EID14_MASK                  equ 0040h
RXB0EIDH_RXB0EID15_POSN                  equ 0007h
RXB0EIDH_RXB0EID15_POSITION              equ 0007h
RXB0EIDH_RXB0EID15_SIZE                  equ 0001h
RXB0EIDH_RXB0EID15_LENGTH                equ 0001h
RXB0EIDH_RXB0EID15_MASK                  equ 0080h

