GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k80.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 0F77h
// bitfield definitions
PIR5_RXB0IF_POSN                         equ 0000h
PIR5_RXB0IF_POSITION                     equ 0000h
PIR5_RXB0IF_SIZE                         equ 0001h
PIR5_RXB0IF_LENGTH                       equ 0001h
PIR5_RXB0IF_MASK                         equ 0001h
PIR5_RXB1IF_POSN                         equ 0001h
PIR5_RXB1IF_POSITION                     equ 0001h
PIR5_RXB1IF_SIZE                         equ 0001h
PIR5_RXB1IF_LENGTH                       equ 0001h
PIR5_RXB1IF_MASK                         equ 0002h
PIR5_TXB0IF_POSN                         equ 0002h
PIR5_TXB0IF_POSITION                     equ 0002h
PIR5_TXB0IF_SIZE                         equ 0001h
PIR5_TXB0IF_LENGTH                       equ 0001h
PIR5_TXB0IF_MASK                         equ 0004h
PIR5_TXB1IF_POSN                         equ 0003h
PIR5_TXB1IF_POSITION                     equ 0003h
PIR5_TXB1IF_SIZE                         equ 0001h
PIR5_TXB1IF_LENGTH                       equ 0001h
PIR5_TXB1IF_MASK                         equ 0008h
PIR5_TXB2IF_POSN                         equ 0004h
PIR5_TXB2IF_POSITION                     equ 0004h
PIR5_TXB2IF_SIZE                         equ 0001h
PIR5_TXB2IF_LENGTH                       equ 0001h
PIR5_TXB2IF_MASK                         equ 0010h
PIR5_ERRIF_POSN                          equ 0005h
PIR5_ERRIF_POSITION                      equ 0005h
PIR5_ERRIF_SIZE                          equ 0001h
PIR5_ERRIF_LENGTH                        equ 0001h
PIR5_ERRIF_MASK                          equ 0020h
PIR5_WAKIF_POSN                          equ 0006h
PIR5_WAKIF_POSITION                      equ 0006h
PIR5_WAKIF_SIZE                          equ 0001h
PIR5_WAKIF_LENGTH                        equ 0001h
PIR5_WAKIF_MASK                          equ 0040h
PIR5_IRXIF_POSN                          equ 0007h
PIR5_IRXIF_POSITION                      equ 0007h
PIR5_IRXIF_SIZE                          equ 0001h
PIR5_IRXIF_LENGTH                        equ 0001h
PIR5_IRXIF_MASK                          equ 0080h
PIR5_FIFOWMIF_POSN                       equ 0000h
PIR5_FIFOWMIF_POSITION                   equ 0000h
PIR5_FIFOWMIF_SIZE                       equ 0001h
PIR5_FIFOWMIF_LENGTH                     equ 0001h
PIR5_FIFOWMIF_MASK                       equ 0001h
PIR5_RXBnIF_POSN                         equ 0001h
PIR5_RXBnIF_POSITION                     equ 0001h
PIR5_RXBnIF_SIZE                         equ 0001h
PIR5_RXBnIF_LENGTH                       equ 0001h
PIR5_RXBnIF_MASK                         equ 0002h
PIR5_TXBnIF_POSN                         equ 0004h
PIR5_TXBnIF_POSITION                     equ 0004h
PIR5_TXBnIF_SIZE                         equ 0001h
PIR5_TXBnIF_LENGTH                       equ 0001h
PIR5_TXBnIF_MASK                         equ 0010h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0F78h
// bitfield definitions
IPR5_RXB0IP_POSN                         equ 0000h
IPR5_RXB0IP_POSITION                     equ 0000h
IPR5_RXB0IP_SIZE                         equ 0001h
IPR5_RXB0IP_LENGTH                       equ 0001h
IPR5_RXB0IP_MASK                         equ 0001h
IPR5_RXB1IP_POSN                         equ 0001h
IPR5_RXB1IP_POSITION                     equ 0001h
IPR5_RXB1IP_SIZE                         equ 0001h
IPR5_RXB1IP_LENGTH                       equ 0001h
IPR5_RXB1IP_MASK                         equ 0002h
IPR5_TXB0IP_POSN                         equ 0002h
IPR5_TXB0IP_POSITION                     equ 0002h
IPR5_TXB0IP_SIZE                         equ 0001h
IPR5_TXB0IP_LENGTH                       equ 0001h
IPR5_TXB0IP_MASK                         equ 0004h
IPR5_TXB1IP_POSN                         equ 0003h
IPR5_TXB1IP_POSITION                     equ 0003h
IPR5_TXB1IP_SIZE                         equ 0001h
IPR5_TXB1IP_LENGTH                       equ 0001h
IPR5_TXB1IP_MASK                         equ 0008h
IPR5_TXB2IP_POSN                         equ 0004h
IPR5_TXB2IP_POSITION                     equ 0004h
IPR5_TXB2IP_SIZE                         equ 0001h
IPR5_TXB2IP_LENGTH                       equ 0001h
IPR5_TXB2IP_MASK                         equ 0010h
IPR5_ERRIP_POSN                          equ 0005h
IPR5_ERRIP_POSITION                      equ 0005h
IPR5_ERRIP_SIZE                          equ 0001h
IPR5_ERRIP_LENGTH                        equ 0001h
IPR5_ERRIP_MASK                          equ 0020h
IPR5_WAKIP_POSN                          equ 0006h
IPR5_WAKIP_POSITION                      equ 0006h
IPR5_WAKIP_SIZE                          equ 0001h
IPR5_WAKIP_LENGTH                        equ 0001h
IPR5_WAKIP_MASK                          equ 0040h
IPR5_IRXIP_POSN                          equ 0007h
IPR5_IRXIP_POSITION                      equ 0007h
IPR5_IRXIP_SIZE                          equ 0001h
IPR5_IRXIP_LENGTH                        equ 0001h
IPR5_IRXIP_MASK                          equ 0080h
IPR5_FIFOWMIP_POSN                       equ 0000h
IPR5_FIFOWMIP_POSITION                   equ 0000h
IPR5_FIFOWMIP_SIZE                       equ 0001h
IPR5_FIFOWMIP_LENGTH                     equ 0001h
IPR5_FIFOWMIP_MASK                       equ 0001h
IPR5_RXBnIP_POSN                         equ 0001h
IPR5_RXBnIP_POSITION                     equ 0001h
IPR5_RXBnIP_SIZE                         equ 0001h
IPR5_RXBnIP_LENGTH                       equ 0001h
IPR5_RXBnIP_MASK                         equ 0002h
IPR5_TXBnIP_POSN                         equ 0004h
IPR5_TXBnIP_POSITION                     equ 0004h
IPR5_TXBnIP_SIZE                         equ 0001h
IPR5_TXBnIP_LENGTH                       equ 0001h
IPR5_TXBnIP_MASK                         equ 0010h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h
IPR5_EVPOL05_POSN                        equ 0003h
IPR5_EVPOL05_POSITION                    equ 0003h
IPR5_EVPOL05_SIZE                        equ 0001h
IPR5_EVPOL05_LENGTH                      equ 0001h
IPR5_EVPOL05_MASK                        equ 0008h
IPR5_EVPOL15_POSN                        equ 0004h
IPR5_EVPOL15_POSITION                    equ 0004h
IPR5_EVPOL15_SIZE                        equ 0001h
IPR5_EVPOL15_LENGTH                      equ 0001h
IPR5_EVPOL15_MASK                        equ 0010h

// Register: TXREG2
#define TXREG2 TXREG2
TXREG2                                   equ 0F79h
// bitfield definitions
TXREG2_TXREG2_POSN                       equ 0000h
TXREG2_TXREG2_POSITION                   equ 0000h
TXREG2_TXREG2_SIZE                       equ 0008h
TXREG2_TXREG2_LENGTH                     equ 0008h
TXREG2_TXREG2_MASK                       equ 00FFh

// Register: RCREG2
#define RCREG2 RCREG2
RCREG2                                   equ 0F7Ah
// bitfield definitions
RCREG2_RCREG2_POSN                       equ 0000h
RCREG2_RCREG2_POSITION                   equ 0000h
RCREG2_RCREG2_SIZE                       equ 0008h
RCREG2_RCREG2_LENGTH                     equ 0008h
RCREG2_RCREG2_MASK                       equ 00FFh

