GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k80.inc
#define RXM1SID7                         BANKMASK(RXM1SIDH), 4, b
#define RXM1SID8                         BANKMASK(RXM1SIDH), 5, b
#define RXM1SID9                         BANKMASK(RXM1SIDH), 6, b
#define RXWARN                           BANKMASK(COMSTAT), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SAM                              BANKMASK(BRGCON2), 6, b
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SEG1PH0                          BANKMASK(BRGCON2), 3, b
#define SEG1PH1                          BANKMASK(BRGCON2), 4, b
#define SEG1PH2                          BANKMASK(BRGCON2), 5, b
#define SEG2PH0                          BANKMASK(BRGCON3), 0, b
#define SEG2PH1                          BANKMASK(BRGCON3), 1, b
#define SEG2PH2                          BANKMASK(BRGCON3), 2, b
#define SEG2PHT                          BANKMASK(BRGCON2), 7, b
#define SEG2PHTS                         BANKMASK(BRGCON2), 7, b
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, a
#define SJW0                             BANKMASK(BRGCON1), 6, b
#define SJW1                             BANKMASK(BRGCON1), 7, b
#define SLRA                             BANKMASK(SLRCON), 0, a
#define SLRB                             BANKMASK(SLRCON), 1, a
#define SLRC                             BANKMASK(SLRCON), 2, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCDRV                          BANKMASK(OSCCON2), 4, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SOSCGO                           BANKMASK(OSCCON2), 3, a
#define SOSCRUN                          BANKMASK(OSCCON2), 6, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, a
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SRETEN                           BANKMASK(WDTCON), 4, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPMD                            BANKMASK(PMD0), 0, b
#define SSPOD                            BANKMASK(ODCON), 7, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define STRA                             BANKMASK(PSTR1CON), 0, a
#define STRB                             BANKMASK(PSTR1CON), 1, a
#define STRC                             BANKMASK(PSTR1CON), 2, a
#define STRD                             BANKMASK(PSTR1CON), 3, a
#define STRSYNC                          BANKMASK(PSTR1CON), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_T1DONE                 BANKMASK(T1GCON), 3, a
#define T1GGO_nT1DONE                    BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GCON), 0, a
#define T1GSS1                           BANKMASK(T1GCON), 1, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_T3DONE                 BANKMASK(T3GCON), 3, a
#define T3GGO_nT3DONE                    BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, a
#define T4CKPS1                          BANKMASK(T4CON), 1, a
#define T4OUTPS0                         BANKMASK(T4CON), 3, a
#define T4OUTPS1                         BANKMASK(T4CON), 4, a
#define T4OUTPS2                         BANKMASK(T4CON), 5, a
#define T4OUTPS3                         BANKMASK(T4CON), 6, a
#define TEC0                             BANKMASK(TXERRCNT), 0, b
#define TEC1                             BANKMASK(TXERRCNT), 1, b
#define TEC2                             BANKMASK(TXERRCNT), 2, b
#define TEC3                             BANKMASK(TXERRCNT), 3, b
#define TEC4                             BANKMASK(TXERRCNT), 4, b
#define TEC5                             BANKMASK(TXERRCNT), 5, b
#define TEC6                             BANKMASK(TXERRCNT), 6, b
#define TEC7                             BANKMASK(TXERRCNT), 7, b
#define TGEN                             BANKMASK(CTMUCONH), 4, b
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS0                          BANKMASK(T1CON), 6, a
#define TMR1CS1                          BANKMASK(T1CON), 7, a
#define TMR1GE                           BANKMASK(T1GCON), 7, a
#define TMR1GIE                          BANKMASK(PIE1), 2, a
#define TMR1GIF                          BANKMASK(PIR1), 2, a
#define TMR1GIP                          BANKMASK(IPR1), 2, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS0                          BANKMASK(T3CON), 6, a
#define TMR3CS1                          BANKMASK(T3CON), 7, a
#define TMR3GE                           BANKMASK(T3GCON), 7, a
#define TMR3GIE                          BANKMASK(PIE2), 0, a
#define TMR3GIF                          BANKMASK(PIR2), 0, a
#define TMR3GIP                          BANKMASK(IPR2), 0, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE4), 7, a
#define TMR4IF                           BANKMASK(PIR4), 7, a
#define TMR4IP                           BANKMASK(IPR4), 7, a
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 2, a
#define TO                               BANKMASK(RCON), 3, a
#define TRIGSEL0                         BANKMASK(ADCON1), 6, a
#define TRIGSEL1                         BANKMASK(ADCON1), 7, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRMT1                            BANKMASK(TXSTA1), 1, a
#define TRMT2                            BANKMASK(TXSTA2), 1, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TUN5                             BANKMASK(OSCTUNE), 5, a
#define TX0IE                            BANKMASK(TXBIE), 2, b
#define TX0IF                            BANKMASK(TXB0CON), 7, b
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2EN                            BANKMASK(CIOCON), 6, a
#define TX2IE                            BANKMASK(PIE3), 4, a
#define TX2IF                            BANKMASK(PIR3), 4, a
#define TX2IP                            BANKMASK(IPR3), 4, a
#define TX2SRC                           BANKMASK(CIOCON), 7, a
#define TX8_9                            BANKMASK(TXSTA1), 6, a
#define TX8_92                           BANKMASK(TXSTA2), 6, a
#define TX91                             BANKMASK(TXSTA1), 6, a
#define TX92                             BANKMASK(TXSTA2), 6, a
#define TX9D1                            BANKMASK(TXSTA1), 0, a
#define TX9D2                            BANKMASK(TXSTA2), 0, a
#define TXB0ABT                          BANKMASK(TXB0CON), 6, b
#define TXB0D00                          BANKMASK(TXB0D0), 0, b
#define TXB0D01                          BANKMASK(TXB0D0), 1, b
#define TXB0D02                          BANKMASK(TXB0D0), 2, b
#define TXB0D03                          BANKMASK(TXB0D0), 3, b
#define TXB0D04                          BANKMASK(TXB0D0), 4, b
#define TXB0D05                          BANKMASK(TXB0D0), 5, b
#define TXB0D06                          BANKMASK(TXB0D0), 6, b
#define TXB0D07                          BANKMASK(TXB0D0), 7, b
#define TXB0D10                          BANKMASK(TXB0D1), 0, b
#define TXB0D11                          BANKMASK(TXB0D1), 1, b
#define TXB0D12                          BANKMASK(TXB0D1), 2, b
#define TXB0D13                          BANKMASK(TXB0D1), 3, b
#define TXB0D14                          BANKMASK(TXB0D1), 4, b
#define TXB0D15                          BANKMASK(TXB0D1), 5, b
#define TXB0D16                          BANKMASK(TXB0D1), 6, b
#define TXB0D17                          BANKMASK(TXB0D1), 7, b
#define TXB0D20                          BANKMASK(TXB0D2), 0, b
#define TXB0D21                          BANKMASK(TXB0D2), 1, b
#define TXB0D22                          BANKMASK(TXB0D2), 2, b
#define TXB0D23                          BANKMASK(TXB0D2), 3, b
#define TXB0D24                          BANKMASK(TXB0D2), 4, b
#define TXB0D25                          BANKMASK(TXB0D2), 5, b
#define TXB0D26                          BANKMASK(TXB0D2), 6, b
#define TXB0D27                          BANKMASK(TXB0D2), 7, b
#define TXB0D30                          BANKMASK(TXB0D3), 0, b
#define TXB0D31                          BANKMASK(TXB0D3), 1, b
#define TXB0D32                          BANKMASK(TXB0D3), 2, b
#define TXB0D33                          BANKMASK(TXB0D3), 3, b
#define TXB0D34                          BANKMASK(TXB0D3), 4, b
#define TXB0D35                          BANKMASK(TXB0D3), 5, b
#define TXB0D36                          BANKMASK(TXB0D3), 6, b
#define TXB0D37                          BANKMASK(TXB0D3), 7, b
#define TXB0D40                          BANKMASK(TXB0D4), 0, b
#define TXB0D41                          BANKMASK(TXB0D4), 1, b
#define TXB0D42                          BANKMASK(TXB0D4), 2, b
#define TXB0D43                          BANKMASK(TXB0D4), 3, b
#define TXB0D44                          BANKMASK(TXB0D4), 4, b
#define TXB0D45                          BANKMASK(TXB0D4), 5, b
#define TXB0D46                          BANKMASK(TXB0D4), 6, b
#define TXB0D47                          BANKMASK(TXB0D4), 7, b
#define TXB0D50                          BANKMASK(TXB0D5), 0, b
#define TXB0D51                          BANKMASK(TXB0D5), 1, b
#define TXB0D52                          BANKMASK(TXB0D5), 2, b
#define TXB0D53                          BANKMASK(TXB0D5), 3, b
#define TXB0D54                          BANKMASK(TXB0D5), 4, b
#define TXB0D55                          BANKMASK(TXB0D5), 5, b
#define TXB0D56                          BANKMASK(TXB0D5), 6, b
#define TXB0D57                          BANKMASK(TXB0D5), 7, b
#define TXB0D60                          BANKMASK(TXB0D6), 0, b
#define TXB0D61                          BANKMASK(TXB0D6), 1, b
#define TXB0D62                          BANKMASK(TXB0D6), 2, b
#define TXB0D63                          BANKMASK(TXB0D6), 3, b
#define TXB0D64                          BANKMASK(TXB0D6), 4, b
#define TXB0D65                          BANKMASK(TXB0D6), 5, b
#define TXB0D66                          BANKMASK(TXB0D6), 6, b
#define TXB0D67                          BANKMASK(TXB0D6), 7, b
#define TXB0D70                          BANKMASK(TXB0D7), 0, b
#define TXB0D71                          BANKMASK(TXB0D7), 1, b
#define TXB0D72                          BANKMASK(TXB0D7), 2, b
#define TXB0D73                          BANKMASK(TXB0D7), 3, b
#define TXB0D74                          BANKMASK(TXB0D7), 4, b
#define TXB0D75                          BANKMASK(TXB0D7), 5, b
#define TXB0D76                          BANKMASK(TXB0D7), 6, b
#define TXB0D77                          BANKMASK(TXB0D7), 7, b
#define TXB0DLC0                         BANKMASK(TXB0DLC), 0, b
#define TXB0DLC1                         BANKMASK(TXB0DLC), 1, b
#define TXB0DLC2                         BANKMASK(TXB0DLC), 2, b
#define TXB0DLC3                         BANKMASK(TXB0DLC), 3, b
#define TXB0EID0                         BANKMASK(TXB0EIDL), 0, b
#define TXB0EID1                         BANKMASK(TXB0EIDL), 1, b
#define TXB0EID10                        BANKMASK(TXB0EIDH), 2, b
#define TXB0EID11                        BANKMASK(TXB0EIDH), 3, b
#define TXB0EID12                        BANKMASK(TXB0EIDH), 4, b
#define TXB0EID13                        BANKMASK(TXB0EIDH), 5, b
#define TXB0EID14                        BANKMASK(TXB0EIDH), 6, b
#define TXB0EID15                        BANKMASK(TXB0EIDH), 7, b
#define TXB0EID16                        BANKMASK(TXB0SIDL), 0, b
#define TXB0EID17                        BANKMASK(TXB0SIDL), 1, b
#define TXB0EID2                         BANKMASK(TXB0EIDL), 2, b
#define TXB0EID3                         BANKMASK(TXB0EIDL), 3, b
#define TXB0EID4                         BANKMASK(TXB0EIDL), 4, b
#define TXB0EID5                         BANKMASK(TXB0EIDL), 5, b
#define TXB0EID6                         BANKMASK(TXB0EIDL), 6, b
#define TXB0EID7                         BANKMASK(TXB0EIDL), 7, b
#define TXB0EID8                         BANKMASK(TXB0EIDH), 0, b
#define TXB0EID9                         BANKMASK(TXB0EIDH), 1, b
#define TXB0ERR                          BANKMASK(TXB0CON), 4, b
#define TXB0EXIDE                        BANKMASK(TXB0SIDL), 3, b
#define TXB0IF                           BANKMASK(PIR5), 2, a
#define TXB0IP                           BANKMASK(IPR5), 2, a
#define TXB0LARB                         BANKMASK(TXB0CON), 5, b
#define TXB0PRI0                         BANKMASK(TXB0CON), 0, b
#define TXB0PRI1                         BANKMASK(TXB0CON), 1, b
#define TXB0REQ                          BANKMASK(TXB0CON), 3, b
#define TXB0RTR                          BANKMASK(TXB0DLC), 6, b
#define TXB0SID0                         BANKMASK(TXB0SIDL), 5, b
#define TXB0SID1                         BANKMASK(TXB0SIDL), 6, b
#define TXB0SID10                        BANKMASK(TXB0SIDH), 7, b
#define TXB0SID2                         BANKMASK(TXB0SIDL), 7, b
#define TXB0SID3                         BANKMASK(TXB0SIDH), 0, b
#define TXB0SID4                         BANKMASK(TXB0SIDH), 1, b
#define TXB0SID5                         BANKMASK(TXB0SIDH), 2, b
#define TXB0SID6                         BANKMASK(TXB0SIDH), 3, b
#define TXB0SID7                         BANKMASK(TXB0SIDH), 4, b
#define TXB0SID8                         BANKMASK(TXB0SIDH), 5, b
#define TXB0SID9                         BANKMASK(TXB0SIDH), 6, b
#define TXB1ABT                          BANKMASK(TXB1CON), 6, b
#define TXB1D00                          BANKMASK(TXB1D0), 0, b
#define TXB1D01                          BANKMASK(TXB1D0), 1, b
#define TXB1D02                          BANKMASK(TXB1D0), 2, b
#define TXB1D03                          BANKMASK(TXB1D0), 3, b
#define TXB1D04                          BANKMASK(TXB1D0), 4, b
#define TXB1D05                          BANKMASK(TXB1D0), 5, b
#define TXB1D06                          BANKMASK(TXB1D0), 6, b
#define TXB1D07                          BANKMASK(TXB1D0), 7, b
#define TXB1D10                          BANKMASK(TXB1D1), 0, b
#define TXB1D11                          BANKMASK(TXB1D1), 1, b
#define TXB1D12                          BANKMASK(TXB1D1), 2, b
#define TXB1D13                          BANKMASK(TXB1D1), 3, b
#define TXB1D14                          BANKMASK(TXB1D1), 4, b
#define TXB1D15                          BANKMASK(TXB1D1), 5, b
#define TXB1D16                          BANKMASK(TXB1D1), 6, b
#define TXB1D17                          BANKMASK(TXB1D1), 7, b
#define TXB1D20                          BANKMASK(TXB1D2), 0, b
#define TXB1D21                          BANKMASK(TXB1D2), 1, b
#define TXB1D22                          BANKMASK(TXB1D2), 2, b
#define TXB1D23                          BANKMASK(TXB1D2), 3, b
#define TXB1D24                          BANKMASK(TXB1D2), 4, b
#define TXB1D25                          BANKMASK(TXB1D2), 5, b
#define TXB1D26                          BANKMASK(TXB1D2), 6, b
#define TXB1D27                          BANKMASK(TXB1D2), 7, b
#define TXB1D30                          BANKMASK(TXB1D3), 0, b
#define TXB1D31                          BANKMASK(TXB1D3), 1, b
#define TXB1D32                          BANKMASK(TXB1D3), 2, b
#define TXB1D33                          BANKMASK(TXB1D3), 3, b
#define TXB1D34                          BANKMASK(TXB1D3), 4, b
#define TXB1D35                          BANKMASK(TXB1D3), 5, b
#define TXB1D36                          BANKMASK(TXB1D3), 6, b
#define TXB1D37                          BANKMASK(TXB1D3), 7, b
#define TXB1D40                          BANKMASK(TXB1D4), 0, b
#define TXB1D41                          BANKMASK(TXB1D4), 1, b
#define TXB1D42                          BANKMASK(TXB1D4), 2, b
#define TXB1D43                          BANKMASK(TXB1D4), 3, b
#define TXB1D44                          BANKMASK(TXB1D4), 4, b
#define TXB1D45                          BANKMASK(TXB1D4), 5, b
#define TXB1D46                          BANKMASK(TXB1D4), 6, b
#define TXB1D47                          BANKMASK(TXB1D4), 7, b
#define TXB1D50                          BANKMASK(TXB1D5), 0, b
#define TXB1D51                          BANKMASK(TXB1D5), 1, b
#define TXB1D52                          BANKMASK(TXB1D5), 2, b
#define TXB1D53                          BANKMASK(TXB1D5), 3, b
#define TXB1D54                          BANKMASK(TXB1D5), 4, b
#define TXB1D55                          BANKMASK(TXB1D5), 5, b
#define TXB1D56                          BANKMASK(TXB1D5), 6, b
#define TXB1D57                          BANKMASK(TXB1D5), 7, b
#define TXB1D60                          BANKMASK(TXB1D6), 0, b
#define TXB1D61                          BANKMASK(TXB1D6), 1, b
#define TXB1D62                          BANKMASK(TXB1D6), 2, b
